// Copyright © 2014 CCP ehf.

#include "StdAfx.h"

#include "Tr2DdsHandler.h"
#include "HostBitmap.h"
#include "CcpMetadata.h"

#ifndef MAKEFOURCC
#define MAKEFOURCC(ch0, ch1, ch2, ch3)                              \
	((uint32_t)(uint8_t)(ch0) | ((uint32_t)(uint8_t)(ch1) << 8) |       \
	((uint32_t)(uint8_t)(ch2) << 16) | ((uint32_t)(uint8_t)(ch3) << 24 ))
#endif /* defined(MAKEFOURCC) */

#define DDS_FOURCC	0x00000004 // DDPF_FOURCC
#define DDS_INDEXED 0x00000020 // DDPF_INDEXED
#define DDS_RGB     0x00000040 // DDPF_RGB
#define DDS_RGBA    0x00000041 // DDPF_RGB | DDPF_ALPHAPIXELS
#define DDS_LUMINANCE 0x20000

#define DDS_HEADER_FLAGS_TEXTURE    0x00001007  // DDSD_CAPS | DDSD_HEIGHT | DDSD_WIDTH | DDSD_PIXELFORMAT 
#define DDS_HEADER_FLAGS_MIPMAP     0x00020000  // DDSD_MIPMAPCOUNT
#define DDS_HEADER_FLAGS_VOLUME     0x00800000  // DDSD_DEPTH
#define DDS_HEADER_FLAGS_PITCH      0x00000008  // DDSD_PITCH
#define DDS_HEADER_FLAGS_LINEARSIZE 0x00080000  // DDSD_LINEARSIZE

#define DDS_SURFACE_FLAGS_TEXTURE 0x00001000 // DDSCAPS_TEXTURE
#define DDS_SURFACE_FLAGS_MIPMAP  0x00400008 // DDSCAPS_COMPLEX | DDSCAPS_MIPMAP
#define DDS_SURFACE_FLAGS_CUBEMAP 0x00000008 // DDSCAPS_COMPLEX

#define DDS_CUBEMAP_POSITIVEX 0x00000600 // DDSCAPS2_CUBEMAP | DDSCAPS2_CUBEMAP_POSITIVEX
#define DDS_CUBEMAP_NEGATIVEX 0x00000a00 // DDSCAPS2_CUBEMAP | DDSCAPS2_CUBEMAP_NEGATIVEX
#define DDS_CUBEMAP_POSITIVEY 0x00001200 // DDSCAPS2_CUBEMAP | DDSCAPS2_CUBEMAP_POSITIVEY
#define DDS_CUBEMAP_NEGATIVEY 0x00002200 // DDSCAPS2_CUBEMAP | DDSCAPS2_CUBEMAP_NEGATIVEY
#define DDS_CUBEMAP_POSITIVEZ 0x00004200 // DDSCAPS2_CUBEMAP | DDSCAPS2_CUBEMAP_POSITIVEZ
#define DDS_CUBEMAP_NEGATIVEZ 0x00008200 // DDSCAPS2_CUBEMAP | DDSCAPS2_CUBEMAP_NEGATIVEZ

#define DDS_CUBEMAP_ALLFACES ( DDS_CUBEMAP_POSITIVEX | DDS_CUBEMAP_NEGATIVEX |\
	DDS_CUBEMAP_POSITIVEY | DDS_CUBEMAP_NEGATIVEY |\
	DDS_CUBEMAP_POSITIVEZ | DDS_CUBEMAP_NEGATIVEZ )

#define DDS_FLAGS_VOLUME 0x00200000 // DDSCAPS2_VOLUME

#define D3D10_RESOURCE_DIMENSION_UNKNOWN   0
#define D3D10_RESOURCE_DIMENSION_BUFFER    1
#define D3D10_RESOURCE_DIMENSION_TEXTURE1D 2
#define D3D10_RESOURCE_DIMENSION_TEXTURE2D 3
#define D3D10_RESOURCE_DIMENSION_TEXTURE3D 4

using namespace ImageIO;

namespace
{

const unsigned int FOURCC_DDS = MAKEFOURCC('D', 'D', 'S', ' ');
const unsigned int FOURCC_DXT1 = MAKEFOURCC('D', 'X', 'T', '1');
const unsigned int FOURCC_DXT2 = MAKEFOURCC('D', 'X', 'T', '2');
const unsigned int FOURCC_DXT3 = MAKEFOURCC('D', 'X', 'T', '3');
const unsigned int FOURCC_DXT4 = MAKEFOURCC('D', 'X', 'T', '4');
const unsigned int FOURCC_DXT5 = MAKEFOURCC('D', 'X', 'T', '5');
const unsigned int FOURCC_DX10 = MAKEFOURCC('D', 'X', '1', '0');
const unsigned int FOURCC_RXGB = MAKEFOURCC('R', 'X', 'G', 'B');
const unsigned int FOURCC_ATI1 = MAKEFOURCC('A', 'T', 'I', '1');
const unsigned int FOURCC_ATI2 = MAKEFOURCC('A', 'T', 'I', '2');

struct DDS_PIXELFORMAT
{
	uint32_t dwSize;			// 4
	uint32_t dwFlags;
	uint32_t dwFourCC;
	uint32_t dwRGBBitCount;	// 16
	uint32_t dwRBitMask;
	uint32_t dwGBitMask;
	uint32_t dwBBitMask;
	uint32_t dwABitMask;		// 32
};

struct DDS_HEADER
{
	uint32_t dwFourCC;				// 4
	uint32_t dwSize;
	uint32_t dwHeaderFlags;
	uint32_t dwHeight;				// 16
	uint32_t dwWidth;
	uint32_t dwPitchOrLinearSize;
	uint32_t dwDepth;				// only if DDS_HEADER_FLAGS_VOLUME is set in dwHeaderFlags
	uint32_t dwMipMapCount;		// 32
	uint32_t dwReserved1[11];		// 76
	DDS_PIXELFORMAT ddspf;		// 108
	uint32_t dwSurfaceFlags;
	uint32_t dwCubemapFlags;		// 116
	uint32_t dwReserved2[3];		// 128
};

struct DDS_HEADER_DXT10
{
	PixelFormat dxgiFormat;
	uint32_t resourceDimension;
	uint32_t miscFlag;
	uint32_t arraySize;
	uint32_t miscFlags2;
};

struct FormatDescriptor
{
	int32_t format;
	unsigned int bitcount;
	unsigned int rmask;
	unsigned int gmask;
	unsigned int bmask;
	unsigned int amask;
	unsigned int fourCC;

	PixelFormat	pixelFormat;
};

#define DDS_MAKEFOURCC(ch0, ch1, ch2, ch3)                              \
            ((uint32_t)(uint8_t)(ch0) | ((uint32_t)(uint8_t)(ch1) << 8) |			\
            ((uint32_t)(uint8_t)(ch2) << 16) | ((uint32_t)(uint8_t)(ch3) << 24 ))


const int32_t DDSFMT_UNKNOWN              =  0;
const int32_t DDSFMT_R8G8B8               = 20;
const int32_t DDSFMT_A8R8G8B8             = 21;
const int32_t DDSFMT_X8R8G8B8             = 22;
const int32_t DDSFMT_R5G6B5               = 23;
const int32_t DDSFMT_X1R5G5B5             = 24;
const int32_t DDSFMT_A1R5G5B5             = 25;
